import tasks_regular
import pytest
"""Находит строки 2+3, 2++3, 2+++3, не захватив остальные (+ может быть любое количество).
    Возвращает лист найденных значений, а на вход принимает строку."""

string_list = [('23 2+3 2++3 2+++3 345 567', ['2+3', '2++3', '2+++3']),
               ('2++++++++++++++++++++++++++++++++++++++3 2+3 2++3 2++++++3 345 567',
                ['2++++++++++++++++++++++++++++++++++++++3', '2+3', '2++3', '2++++++3']),
               ('23 23 23 23 345 567', []),
               ('2+33', []),
               ('222+++++3333', [])]


@pytest.mark.parametrize("string, result", string_list)
def test_match_6(string, result):
    assert tasks_regular.match_6(string) == result